def build_sales_report():
    """Собирает отчет по продажам

    Пример отчета:
    Отчет по продажам из CRM за 18.06.2020
    💰 Прибыль по сделкам: 0 руб.
    💰 Прибыль по счетам: 0 руб.
    ⚠️ Долг: 0 руб.
    ⌛️ Ожидаются сегодня: 0 руб."""
    pass


def build_general_report():
    """Собирает все отчеты

    Пример отчета:
    Основной отчет из CRM за 18.06.2020
    📌 Кол-во лидов: 0
    👏 Кол-во сделок: 0
    ✅ Конверсия из лидов в сделки: 0%
    💰 Прибыль по сделкам: 0 руб.
    💰 Прибыль по счетам: 0 руб."""
    pass


def build_leads_report():
    """Собирает отчеты по лидам

     Пример отчета:
     Отчет по лидам из CRM за 18.06.2020
     📌 Новые: 0
     Изменены сегодня:
     ✅ Успешных: 0
     ❌ Неуспешных: 0
     ⚠️ Необработанные: 0
     ⏰ В работе: 0"""
    pass


def build_deals_report():
    """Собирает отчеты по сделкам

       Пример отчета:
     Отчет по сделкам из CRM за 18.06.2020
     👏 Новые: 0
     ✅ Успешных: 0
     ❌ Неуспешных: 0
     ⏰ Необработанные: 0
     ⚠️ В работе: 0
     💰 Прибыль: 0 руб."""
    pass
